; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city9)
	(fuel-level plane1 fl0)
	(at plane2 city5)
	(fuel-level plane2 fl1)
	(at plane3 city2)
	(fuel-level plane3 fl3)
	(at plane4 city0)
	(fuel-level plane4 fl1)
	(at plane5 city10)
	(fuel-level plane5 fl1)
	(at plane6 city7)
	(fuel-level plane6 fl4)
	(at person1 city2)
	(at person2 city11)
	(at person3 city12)
	(at person4 city10)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city8)
	(at person2 city2)
	(at person3 city2)
	(at person4 city0)
	))

)

; plan
1. (board person4 plane5 city10)
   deleted: (at person4 city10)
   added: (in person4 plane5)
   goals met: 0 of 4
2. (fly plane5 city10 city0 fl1 fl0)
   deleted: (at plane5 city10) (fuel-level plane5 fl1)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 0 of 4
3. (debark person4 plane5 city0)
   deleted: (in person4 plane5)
   added: (at person4 city0)
   goals met: 1 of 4
4. (board person1 plane3 city2)
   deleted: (at person1 city2)
   added: (in person1 plane3)
   goals met: 1 of 4
5. (zoom plane3 city2 city8 fl3 fl2 fl1)
   deleted: (at plane3 city2) (fuel-level plane3 fl3)
   added: (at plane3 city8) (fuel-level plane3 fl1)
   goals met: 1 of 4
6. (debark person1 plane3 city8)
   deleted: (in person1 plane3)
   added: (at person1 city8)
   goals met: 2 of 4
7. (fly plane2 city5 city11 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 2 of 4
8. (board person2 plane2 city11)
   deleted: (at person2 city11)
   added: (in person2 plane2)
   goals met: 2 of 4
9. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 2 of 4
10. (fly plane2 city11 city2 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 2 of 4
11. (debark person2 plane2 city2)
   deleted: (in person2 plane2)
   added: (at person2 city2)
   goals met: 3 of 4
12. (fly plane3 city8 city12 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city12) (fuel-level plane3 fl0)
   goals met: 3 of 4
13. (fly plane4 city0 city12 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city12) (fuel-level plane4 fl0)
   goals met: 3 of 4
14. (zoom plane6 city7 city12 fl4 fl3 fl2)
   deleted: (at plane6 city7) (fuel-level plane6 fl4)
   added: (at plane6 city12) (fuel-level plane6 fl2)
   goals met: 3 of 4
15. (board person3 plane6 city12)
   deleted: (at person3 city12)
   added: (in person3 plane6)
   goals met: 3 of 4
16. (zoom plane6 city12 city2 fl2 fl1 fl0)
   deleted: (at plane6 city12) (fuel-level plane6 fl2)
   added: (at plane6 city2) (fuel-level plane6 fl0)
   goals met: 3 of 4
17. (debark person3 plane6 city2)
   deleted: (in person3 plane6)
   added: (at person3 city2)
   goals met: 4 of 4
